export interface Clinic {
  id: number;
  name: string;
  type: string;
  address: string;
  city: string;
  coords: [number, number]; // [lat, lon]
}

export const clinics: Clinic[] = [
  { id: 1, name: "Юнона", type: "Медцентр, клиника", address: "Советская ул., 51, Ростов-на-Дону", city: "Ростов-на-Дону", coords: [47.222078, 39.720349] },
  { id: 2, name: "Консультативно-диагностическое отделение МКНЦ", type: "Диагностический центр", address: "ш. Энтузиастов, 84/1к4, Москва", city: "Москва", coords: [55.773889, 37.782778] },
  { id: 3, name: "Ильинская больница", type: "Медцентр, клиника", address: "ул. Рублёвское Предместье, 2, корп. 2, д. Глухово", city: "Глухово", coords: [55.729683, 37.105194] },
  { id: 4, name: "Самарский областной клинический онкологический диспансер", type: "Диспансер", address: "Солнечная ул., 50, Самара", city: "Самара", coords: [53.212273, 50.291515] },
  { id: 5, name: "Евромед", type: "Медцентр, клиника", address: "Съездовская ул., 29/3, Омск", city: "Омск", coords: [54.984701, 73.374611] },
  { id: 6, name: "Центр интервенционной маммологии", type: "Медцентр, клиника", address: "к1515, Зеленоград", city: "Зеленоград", coords: [55.986736, 37.195168] },
  { id: 7, name: "Клиника Борисовых", type: "Диагностический центр", address: "Аэровокзальная ул., 8, Красноярск", city: "Красноярск", coords: [56.017479, 92.872425] },
  { id: 8, name: "Центр новых медицинских технологий", type: "Медцентр, клиника", address: "ул. Пирогова, 25/4, Академгородок, Новосибирск", city: "Новосибирск", coords: [54.847969, 83.093976] },
  { id: 9, name: "Красноярский краевой клинический онкологический диспансер им. А. И. Крыжановского", type: "Диспансер", address: "1-я Смоленская ул., 16, корп. 6, Красноярск", city: "Красноярск", coords: [56.033333, 92.916667] },
  { id: 10, name: "ГБУЗ центр специализированных видов медицинской помощи им. В. П. Аваева", type: "Поликлиника для взрослых", address: "ул. Софьи Перовской, 56, Тверь", city: "Тверь", coords: [56.859540, 35.917778] },
  { id: 11, name: "ФГБУ НМИЦ акушерства, гинекологии и перинатологии им. академика В.И. Кулакова", type: "Специализированная больница", address: "ул. Академика Опарина, 4, Москва", city: "Москва", coords: [55.649444, 37.502500] },
  { id: 12, name: "Моситалмед", type: "Медцентр, клиника", address: "ул. Арбат, 28/1с1, Москва", city: "Москва", coords: [55.752222, 37.595000] },
  { id: 13, name: "ГБУЗ Челябинский областной клинический центр онкологии и ядерной медицины", type: "Поликлиника для взрослых", address: "ул. Блюхера, 42Б, Челябинск", city: "Челябинск", coords: [55.178880, 61.378889] },
  { id: 14, name: "Plasma Clinic Laboratory", type: "Медцентр, клиника", address: "ул. Александра Пушкина, 141-36, Батуми", city: "Батуми", coords: [41.645833, 41.640833] },
  { id: 15, name: "ГБУЗ Иркутский областной онкологический диспансер", type: "Диспансер", address: "ул. Фрунзе, 32, Иркутск", city: "Иркутск", coords: [52.285556, 104.288611] },
  { id: 16, name: "Европейский медицинский центр", type: "Медцентр, клиника", address: "ул. Правды, 15, стр. 1, Москва", city: "Москва", coords: [55.782500, 37.580000] },
  { id: 17, name: "Медицинский центр малоинвазивных технологий Сонэра", type: "Диагностический центр", address: "ул. Энтузиастов, 17, Петрозаводск", city: "Петрозаводск", coords: [61.791667, 34.358333] },
  { id: 18, name: "Промедицина", type: "Медцентр, клиника", address: "ул. Цюрупы, 40, Уфа", city: "Уфа", coords: [54.716111, 55.964444] },
  { id: 19, name: "Grand medica", type: "Медцентр, клиника", address: "Октябрьский просп., 4, Новокузнецк", city: "Новокузнецк", coords: [53.749722, 87.111389] },
  { id: 20, name: "Клиника Дружковых", type: "Медцентр, клиника", address: "ул. Сибгата Хакима, 31, Казань", city: "Казань", coords: [55.818611, 49.118611] },
  { id: 21, name: "АРС Медика", type: "Медцентр, клиника", address: "Советский просп., 12Б, Калининград", city: "Калининград", coords: [54.714444, 20.500833] },
  { id: 22, name: "МЕДиКО", type: "Медцентр, клиника", address: "ул. Александра Невского, 76В, Калининград", city: "Калининград", coords: [54.708056, 20.474722] },
  { id: 23, name: "WMT", type: "Медцентр, клиника", address: "ул. 1 Мая, 222, Краснодар", city: "Краснодар", coords: [45.018056, 38.990833] },
  { id: 24, name: "Клиника Семейная", type: "Медцентр, клиника", address: "ул. Сергия Радонежского, 5, стр. 1, Москва", city: "Москва", coords: [55.748611, 37.666944] },
  { id: 25, name: "Инномед-плюс", type: "Медцентр, клиника", address: "2-я Круговая ул., 10, Владивосток", city: "Владивосток", coords: [43.124722, 131.905833] },
  { id: 26, name: "Целитель", type: "Гинекологическая клиника", address: "ул. Шамсулы Алиева, 4А, Махачкала", city: "Махачкала", coords: [42.963333, 47.504722] },
  { id: 27, name: "Лекарь", type: "Медцентр, клиника", address: "ул. Гайдара Гаджиева, 24Ж, Махачкала", city: "Махачкала", coords: [42.976389, 47.493889] },
  { id: 28, name: "Здоровье", type: "Медцентр, клиника", address: "Строительная ул., 3/2, Дербент", city: "Дербент", coords: [42.057778, 48.294444] },
  { id: 29, name: "Альфа-Центр Здоровья", type: "Медцентр, клиника", address: "ул. Пушкина, 50, Пермь", city: "Пермь", coords: [58.012222, 56.248611] },
  { id: 30, name: "Пирогова", type: "Медцентр, клиника", address: "ул. Спартака, 42Б, Тверь", city: "Тверь", coords: [56.859833, 35.902778] },
  { id: 31, name: "Европа", type: "Медцентр, клиника", address: "пер. Мархлевского, 17, Иваново", city: "Иваново", coords: [57.001944, 40.975833] },
  { id: 32, name: "Евромед", type: "Медцентр, клиника", address: "Краснофлотская ул., 40, Улан-Удэ", city: "Улан-Удэ", coords: [51.836944, 107.589167] },
  { id: 33, name: "Клиника дoктopa Нелип", type: "Специализированная больница", address: "ул. Павлова, 5, Улан-Удэ", city: "Улан-Удэ", coords: [51.827500, 107.616944] },
  { id: 34, name: "ФНКЦ ФМБА России", type: "Медцентр, клиника", address: "Ореховый бул., 28, Москва", city: "Москва", coords: [55.616111, 37.711111] },
  { id: 35, name: "Сургутский окружной клинический центр охраны материнства и детства", type: "Родильный дом", address: "Пролетарский просп., 15, Сургут", city: "Сургут", coords: [61.254167, 73.396944] },
  { id: 36, name: "Сургутская окружная клиническая больница", type: "Больница для взрослых", address: "ул. Энергетиков, 24, корп. 3, Сургут", city: "Сургут", coords: [61.240556, 73.431111] },
  { id: 37, name: "Поликлиника Мниои им. П. А. Герцена", type: "НИИ", address: "Погодинская ул., 6, стр. 1, Москва", city: "Москва", coords: [55.727500, 37.556944] },
  { id: 38, name: "Медицина", type: "Медцентр, клиника", address: "2-й Тверской-Ямской пер., 10, Москва", city: "Москва", coords: [55.774722, 37.594167] },
  { id: 39, name: "ЛРЦ Минэкономразвития", type: "Поликлиника для взрослых", address: "Столовый пер., 5, Москва", city: "Москва", coords: [55.764444, 37.599722] },
  { id: 40, name: "Медицинский комплекс ДВФУ", type: "Медцентр, клиника", address: "кампус ДВФУ, о. Русский, Владивосток", city: "Владивосток", coords: [43.027222, 131.893611] },
  { id: 41, name: "ФламингоМед", type: "Медцентр, клиника", address: "просп. Ленина, 89, Мурманск", city: "Мурманск", coords: [68.974722, 33.095278] },
  { id: 42, name: "МЦ Сонар", type: "Медцентр, клиника", address: "ул. Хоца Намсараева, 2Б, Улан-Удэ", city: "Улан-Удэ", coords: [51.822778, 107.628889] },
  { id: 43, name: "ПримаМед", type: "Медцентр, клиника", address: "просп. 100-летия Владивостока, 103, Владивосток", city: "Владивосток", coords: [43.159167, 131.938056] },
  { id: 44, name: "Первый клинический медицинский центр", type: "Медцентр, клиника", address: "ул. Ватутина, 90, Ковров", city: "Ковров", coords: [56.367500, 41.339167] },
  { id: 45, name: "Клиника современных технологий Садко", type: "Медцентр, клиника", address: "ул. Бекетова, 13, Нижний Новгород", city: "Нижний Новгород", coords: [56.313889, 43.998611] },
  { id: 46, name: "Клиника Фомина на Спартака", type: "Медцентр, клиника", address: "ул. Спартака, 42А, Тверь", city: "Тверь", coords: [56.859722, 35.902500] },
  { id: 47, name: "Лечебно-реабилитационный центр Минздрава РФ", type: "Медицинская реабилитация", address: "Иваньковское ш., 3, стр. 5, Москва", city: "Москва", coords: [55.846389, 37.449167] },
  { id: 48, name: "Лечебно-диагностический центр НКЦ №2 (ЦКБ РАН)", type: "Медцентр, клиника", address: "Литовский бул., 1А, Москва", city: "Москва", coords: [55.588333, 37.576389] },
  { id: 49, name: "XXI век", type: "Медцентр, клиника", address: "Большой Сампсониевский просп., 45, Санкт-Петербург", city: "Санкт-Петербург", coords: [59.966389, 30.340278] },
  { id: 50, name: "ФГБУ НМИЦ онкологии им. Н. Н. Петрова Минздрава России", type: "Специализированная больница", address: "Ленинградская ул., 68, посёлок Песочный", city: "Санкт-Петербург", coords: [60.123611, 30.164722] },
  { id: 51, name: "СПб клиническая больница Российской академии наук", type: "Больница для взрослых", address: "просп. Тореза, 72, Санкт-Петербург", city: "Санкт-Петербург", coords: [60.007778, 30.355278] },
  { id: 52, name: "Клиника доктора Одинцова", type: "Медцентр, клиника", address: "Богатырский просп., 22, корп. 1, Санкт-Петербург", city: "Санкт-Петербург", coords: [59.993611, 30.277222] }
];
